docs/leets/11101-Coin-Exchange.org
* 11101. Coin Exchange
:PROPERTIES:
:Created:  2024-06-06
:END:

#+begin_src js

  function coinChange(coins, amount) {
      let dp = Array(amount + 1).fill(amount + 1);

      dp[0] = 0;

      for (let i = 1; i < dp.length; i++) {
          for (let n = 0; n < coins.length; n++) {
              const prevCoinIdx = i - coins[n];
              if (prevCoinIdx < 0) {
                  continue;
              }
              dp[i] = Math.min(dp[i], dp[prevCoinIdx] + 1);
          }
          console.table(dp);
      }
      return dp[dp.length - 1];

  }

  // Test cases
  const testCases = [
      { c: [1, 3, 5], a: 11,  expected: 3 },
  ];

  testCases.forEach((test, index) => {
      const result = coinChange(test.c, test.a);
      console.log(`Test Case ${index + 1}: ${JSON.stringify(result) === JSON.stringify(test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(result)})`);
  });
#+end_src

#+RESULTS:
#+begin_example
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   12   │
│    3    │   12   │
│    4    │   12   │
│    5    │   12   │
│    6    │   12   │
│    7    │   12   │
│    8    │   12   │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   12   │
│    4    │   12   │
│    5    │   12   │
│    6    │   12   │
│    7    │   12   │
│    8    │   12   │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   12   │
│    5    │   12   │
│    6    │   12   │
│    7    │   12   │
│    8    │   12   │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   12   │
│    6    │   12   │
│    7    │   12   │
│    8    │   12   │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   1    │
│    6    │   12   │
│    7    │   12   │
│    8    │   12   │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   1    │
│    6    │   2    │
│    7    │   12   │
│    8    │   12   │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   1    │
│    6    │   2    │
│    7    │   3    │
│    8    │   12   │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   1    │
│    6    │   2    │
│    7    │   3    │
│    8    │   2    │
│    9    │   12   │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   1    │
│    6    │   2    │
│    7    │   3    │
│    8    │   2    │
│    9    │   3    │
│   10    │   12   │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   1    │
│    6    │   2    │
│    7    │   3    │
│    8    │   2    │
│    9    │   3    │
│   10    │   2    │
│   11    │   12   │
└─────────┴────────┘
┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│    0    │   0    │
│    1    │   1    │
│    2    │   2    │
│    3    │   1    │
│    4    │   2    │
│    5    │   1    │
│    6    │   2    │
│    7    │   3    │
│    8    │   2    │
│    9    │   3    │
│   10    │   2    │
│   11    │   3    │
└─────────┴────────┘
Test Case 1: Passed (Expected: 3, Got: 3)
undefined
#+end_example

