docs/leets/11101-Coin-Exchange.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 
</div>
<div id="content" class="content">
<div id="outline-container-org0bfd9fb" class="outline-2">
<h2 id="org0bfd9fb">11101. Coin Exchange</h2>
<div class="outline-text-2" id="text-org0bfd9fb">
<div class="org-src-container">
<pre class="src src-js">
function coinChange(coins, amount) {
    let dp = Array(amount + 1).fill(amount + 1);

    dp[0] = 0;

    for (let i = 1; i &lt; dp.length; i++) {
        for (let n = 0; n &lt; coins.length; n++) {
            const prevCoinIdx = i - coins[n];
            if (prevCoinIdx &lt; 0) {
                continue;
            }
            dp[i] = Math.min(dp[i], dp[prevCoinIdx] + 1);
        }
        console.table(dp);
    }
    return dp[dp.length - 1];

}

// Test cases
const testCases = [
    { c: [1, 3, 5], a: 11,  expected: 3 },
];

testCases.forEach((test, index) =&gt; {
    const result = coinChange(test.c, test.a);
    console.log(`Test Case ${index + 1}: ${JSON.stringify(result) === JSON.stringify(test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(result)})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
